In [2]:
# to read the csv File  
import pandas as pd
a=pd.read_csv('Dataset/Unemployment.csv')
a

     zip  unemployment  participants
0   1001          0.06         13801
1   1002          0.09         24551
2   1003          0.17         11477
3   1004          0.10          4086
4   1005          0.05         11362
5   1006          0.38          7898
6   1007          0.56          9465
7   1008          0.65           946
8   1009          0.76           976
9   1010          0.77           876
10  1011          0.78          1234

In [4]:
#find the type
type(a.index)

pandas.core.indexes.range.RangeIndex

In [5]:
#prints columns names
a.columns

Index(['zip', 'unemployment', 'participants'], dtype='object')

In [11]:
#to print Maximum first 5  data
a.head()

    zip  unemployment  participants
0  1001          0.06         13801
1  1002          0.09         24551
2  1003          0.17         11477
3  1004          0.10          4086
4  1005          0.05         11362

In [12]:
#to print as many data present , give how many values needed and print the data 
a.head(10)

    zip  unemployment  participants
0  1001          0.06         13801
1  1002          0.09         24551
2  1003          0.17         11477
3  1004          0.10          4086
4  1005          0.05         11362
5  1006          0.38          7898
6  1007          0.56          9465
7  1008          0.65           946
8  1009          0.76           976
9  1010          0.77           876

In [4]:
#to get the complete information about the data
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
zip             11 non-null int64
unemployment    11 non-null float64
participants    11 non-null int64
dtypes: float64(1), int64(2)
memory usage: 304.0 bytes

In [13]:
#To name the Index 
a.index=a['zip']
a

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477
1004  1004          0.10          4086
1005  1005          0.05         11362
1006  1006          0.38          7898
1007  1007          0.56          9465
1008  1008          0.65           946
1009  1009          0.76           976
1010  1010          0.77           876
1011  1011          0.78          1234

In [10]:
a.head()

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477
1004  1004          0.10          4086
1005  1005          0.05         11362

In [12]:
a.head(3)

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477

In [14]:
#to delete the necessary data as per column name 
del a['zip']

In [15]:
a

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362
1006          0.38          7898
1007          0.56          9465
1008          0.65           946
1009          0.76           976
1010          0.77           876
1011          0.78          1234

In [16]:
#here we print 3 data values 
a.head(3)

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477

In [17]:
#to print all the values in the index 
a.index

Int64Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011], dtype='int64', name='zip')

In [18]:
# to find the index name 
a.index.name

'zip'

In [24]:
#to find the Column names 
a.columns

Index(['unemployment', 'participants'], dtype='object')

In [27]:
#to print the data in series 
series=pd.read_csv('Dataset/Unemployment.csv',index_col='zip')
print(series)

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362
1006          0.38          7898
1007          0.56          9465
1008          0.65           946
1009          0.76           976
1010          0.77           876
1011          0.78          1234

In [29]:
series.head()

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362

In [31]:
series.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 1001 to 1011
Data columns (total 2 columns):
unemployment    11 non-null float64
participants    11 non-null int64
dtypes: float64(1), int64(1)
memory usage: 264.0 bytes

In [20]:
#to print the excel(xlsx) data and name the index column  
df=pd.read_excel('Dataset/sales.xlsx',index_col='month');
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [21]:
#to print first maximum 5 data in the file
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [22]:
#to print all the details about the file
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
eggs    6 non-null int64
salt    5 non-null float64
spam    6 non-null int64
dtypes: float64(1), int64(2)
memory usage: 168.0+ bytes

In [23]:
#To find the particular value in the entire file.indexing using column names
df['salt']['Jan']
df['salt']['Feb']

50.0

In [24]:
df['eggs']['Jan']

47

In [27]:

df.eggs['Mar']

221

In [52]:
#location 
#to find the particular value by using indexing 
#we can use only column and row names for loc 
df.loc['Jan','eggs']

47

In [13]:
#iLOc- Indexing location 
#gives the indexed value only using the index position (numbers) 
df.iloc[3]

eggs    77.0
salt    87.0
spam    20.0
Name: Apr, dtype: float64

In [14]:
df.iloc[2,2]

72

In [16]:
# Data frames 
# create a variable name fr data frame 
df_new=df[['salt','eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

In [18]:
#slicing
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [28]:
'''Using slicing and indexing 
imp: in this case it will print all the values from 1 to 4. not as normal slicing (4-1), 
it will print 1 to including 4 all the data'''
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [22]:
df['eggs'][:4]

month
Jan     47
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [24]:
df['eggs'][4:]

month
May    132
Jun    205
Name: eggs, dtype: int64

In [26]:
# using loc Slicing (in this case it will print all the values from eggs and salt)
df.loc[:,'eggs':'salt']

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [34]:
'''iloc for finding the 3rd indexed data (in this case 'Apr' is the 3rd indexed )'''
df.iloc[3]

eggs    77.0
salt    87.0
spam    20.0
Name: Apr, dtype: float64

In [41]:
#in this case of slicing , Mar to May to related salt and spam values 
df.loc['Mar':'May','salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [42]:
#to print the specified first slicing 2to 4th values and the related second slicing 
df.iloc[2:5,:1]

       eggs
month
Mar     221
Apr      77
May     132

In [43]:
# this case slcing inside a slicing , extended slicing 
df.loc['Jan':'May',['eggs','spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

In [60]:
#prints all the specified value itemsby appropriate possitions 
df.iloc[[0,4,5,3],0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0
Apr      77  87.0

In [61]:
#iloc for values, loc for names

In [63]:
#using Comparison operators 
df.eggs>20

month
Jan    True
Feb    True
Mar    True
Apr    True
May    True
Jun    True
Name: eggs, dtype: bool

In [48]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [51]:
#series
df['eggs']
type(df['eggs'])

pandas.core.series.Series

In [55]:
#dataframes
df[['eggs']]
type(df[['eggs']])

pandas.core.frame.DataFrame

In [57]:
#Gives al the possibilties in bool
df.salt>60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [64]:
#gives only values in Possibilities
df[df.salt>60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [68]:
#another way 
z=df.salt>60
df[z]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [70]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [72]:
# using AND  if both condition is true 
df[(df.salt>=50)&(df.eggs<200)]

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [74]:
#using OR(if any one condition is true)
df[(df.salt>=50)|(df.eggs<200)]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [82]:
#Copying the data and adding one more column
df2=df.copy()
df2['bacon']=[1,0,50,60,70,80]
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      1
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [83]:
#non zero values in a data
# all() will print only the non zero values 
df2.loc[:,df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [85]:
#any() prints all values including zeros 
df2.loc[:,df2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      1
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [87]:
# to find the null values
df2.loc[:,df2.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

In [89]:
#except null values 
df2.loc[:,df2.notnull().all()]

       eggs  spam  bacon
month
Jan      47    17      1
Feb     110    31      0
Mar     221    72     50
Apr      77    20     60
May     132    52     70
Jun     205    55     80

In [96]:
#to drop(delete) the data 
print(df)
delete=df.dropna(how='any')

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [98]:
print(delete)

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

In [100]:
#to find the cost of each items using floor division
df.floordiv(12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [103]:
import numpy as np
np.floor_divide(df,12)

c:\users\user\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in floor_divide

       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    18.0   7.0   6.0
Apr     6.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

In [106]:
#using Python Functions 
def dozens(n):
    return n//12
df.apply(dozens)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [109]:
#using simple lambda 
df.apply(lambda n:n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [117]:
#to give addtional column details 
df['dozens of eggs']=df.eggs.floordiv(12)
df['kg of salt']=df.salt.floordiv(12)
df['milli grams of  spam ']=df.spam.floordiv(12)
print(df)

       eggs  salt  spam  dozens of eggs  kg of salt  milli grams of  spam
month
Jan      47  12.0    17               3         1.0                      1
Feb     110  50.0    31               9         4.0                      2
Mar     221  89.0    72              18         7.0                      6
Apr      77  87.0    20               6         7.0                      1
May     132   NaN    52              11         NaN                      4
Jun     205  60.0    55              17         5.0                      4

In [121]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

In [124]:
df.columns

Index(['eggs', 'salt', 'spam', 'dozens of eggs', 'kg of salt',
       'milli grams of  spam '],
      dtype='object')

In [29]:
# to print the index name in upper case 
df.index=df.index.str.upper ()
df

       eggs  salt  spam
month
JAN      47  12.0    17
FEB     110  50.0    31
MAR     221  89.0    72
APR      77  87.0    20
MAY     132   NaN    52
JUN     205  60.0    55